-- phpMyAdmin SQL Dump
-- version 4.0.6deb1
-- http://www.phpmyadmin.net
--
-- Хост: localhost
-- Время создания: Дек 24 2014 г., 21:11
-- Версия сервера: 5.5.37-0ubuntu0.13.10.1
-- Версия PHP: 5.5.3-1ubuntu2.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `phplessons`
--

-- --------------------------------------------------------

--
-- Структура таблицы `posts`
--

CREATE TABLE IF NOT EXISTS `posts` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `message` tinytext COLLATE utf8_unicode_ci NOT NULL,
  `author` int(11) NOT NULL,
  `sended` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `theme` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=65 ;

--
-- Дамп данных таблицы `posts`
--

INSERT INTO `posts` (`id`, `message`, `author`, `sended`, `theme`) VALUES
(1, 'Привет всем!', 1, '2013-11-18 23:20:05', 1),
(2, 'неудачное сообщение', 1, '2013-11-21 07:13:02', 1),
(3, 'И почему так вышло?', 1, '2013-11-21 07:16:49', 1),
(4, 'А где динамическое обновление таблицы?', 1, '2013-11-21 07:40:24', 1),
(5, 'Данные удаляются?', 1, '2013-11-21 07:42:25', 1),
(6, 'Проверь! ;)', 1, '2013-11-21 07:44:18', 1),
(7, 'hey', 1, '2013-11-21 07:51:24', 1),
(8, 'stop', 1, '2013-11-21 07:51:49', 1),
(9, 'hello', 1, '2013-11-21 07:53:01', 1),
(10, 'Привет привет', 1, '2013-11-21 07:53:19', 1),
(11, 'Просто жди', 1, '2013-11-21 07:54:45', 1),
(12, 'может обновиться другая таблица, но не факт', 1, '2013-11-21 08:07:58', 1),
(13, 'Не факт :(', 1, '2013-11-21 08:09:12', 1),
(14, 'еще попытка', 1, '2013-11-21 08:09:53', 1),
(15, 'nooo', 1, '2013-11-21 08:13:54', 1),
(16, 'давай же', 1, '2013-11-21 08:15:32', 1),
(17, 'what?', 1, '2013-11-21 08:16:27', 1),
(18, 'а сейчас?', 1, '2013-11-21 08:17:01', 1),
(19, 'гни', 1, '2013-11-21 08:17:50', 1),
(20, 'а ошибка прозаической кавычки', 1, '2013-11-21 08:18:32', 1),
(21, 'теперь часики', 1, '2013-11-21 08:21:41', 1),
(22, 'но я их не вижу', 1, '2013-11-21 08:22:52', 1),
(23, 'когда-то пустое сообщение 1', 1, '2013-11-21 08:23:40', 1),
(24, 'когда-то пустое сообщение 2', 1, '2013-11-21 08:23:46', 1),
(25, 'Кто вообще разрешил пустые сообщения?', 1, '2013-11-21 08:24:03', 1),
(26, 'проверить надо это', 1, '2013-11-21 08:31:11', 1),
(27, 'немного работает даже', 1, '2013-11-21 08:53:40', 1),
(28, 'попробую в следующий раз динамическое обновление', 1, '2013-11-21 09:01:42', 1),
(29, 'Как это работает?', 1, '2013-11-21 09:06:52', 1),
(30, 'Тестируем!', 1, '2013-11-21 09:07:34', 1),
(31, 'Не с первого раза. А сейчас?', 1, '2013-11-21 09:08:43', 1),
(32, 'Опять не то. А ща?', 1, '2013-11-21 09:12:13', 1),
(33, 'почти...', 1, '2013-11-21 09:12:24', 1),
(34, 'А как два сразу?', 1, '2013-11-21 09:16:46', 1),
(35, 'уже не знаю,как заставить \nто работать', 1, '2013-11-21 09:20:50', 1),
(36, 'и сразу заработал!', 1, '2013-11-21 09:20:56', 1),
(37, 'почти чат)', 1, '2013-11-21 09:21:16', 1),
(38, 'Дак вообще работает!', 2, '2013-11-21 18:01:13', 1),
(39, 'все ещё работает!', 1, '2013-11-27 07:11:45', 1),
(40, 'ajax function', 1, '2013-11-27 08:28:21', 1),
(41, 'hello', 1, '2013-12-05 11:28:55', 1),
(42, 'just test', 1, '2013-12-12 08:43:46', 1),
(43, 'Кар-р-рамба!', 1, '2013-12-12 09:47:07', 2),
(44, 'Проба пера, а то ajax не грузил новые темы.', 1, '2013-12-12 15:47:54', 3),
(45, 'Я там был!', 1, '2013-12-12 18:12:01', 4),
(46, 'Я не готов!', 1, '2013-12-12 19:26:31', 5),
(47, 'Я - хочу!', 1, '2013-12-12 19:28:33', 6),
(48, 'ТЫ?', 1, '2013-12-12 19:29:37', 5),
(49, 'Гамбургер?', 1, '2013-12-12 19:29:54', 6),
(50, 'Красиво!', 1, '2013-12-13 23:42:06', 1),
(51, 'Сейчас грузит!', 1, '2013-12-14 11:34:18', 3),
(52, 'Доделать еще', 1, '2013-12-14 18:55:14', 3),
(53, 'Доделал!', 1, '2013-12-14 18:57:56', 3),
(54, 'А так неплохо', 1, '2013-12-14 18:58:26', 3),
(55, 'Да, нормально!', 1, '2013-12-14 18:59:53', 3),
(56, 'Тут можно написать что-нибудь.', 1, '2013-12-14 19:00:38', 7),
(57, 'Ха', 1, '2013-12-14 19:01:14', 8),
(58, 'Очень простая!', 1, '2013-12-14 19:01:26', 7),
(59, 'Всем привет!', 1, '2013-12-14 19:01:36', 1),
(60, 'Здарова!', 3, '2013-12-15 23:17:29', 1),
(61, 'Приветики!', 4, '2014-03-12 13:13:52', 1),
(62, 'Всем привет!', 5, '2014-05-16 07:45:31', 1),
(63, 'Почему так долго отправляется сообщение?', 5, '2014-05-16 07:45:55', 1),
(64, 'О, уже быстро!', 5, '2014-05-16 07:46:05', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `themes`
--

CREATE TABLE IF NOT EXISTS `themes` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `updated` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `author` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=9 ;

--
-- Дамп данных таблицы `themes`
--

INSERT INTO `themes` (`id`, `title`, `updated`, `author`) VALUES
(1, 'Welcome!', '2014-05-16 07:46:05', 1),
(2, 'Пираты', '2013-12-12 09:47:07', 1),
(3, 'Что такого?', '2013-12-14 18:59:53', 1),
(4, 'Кто был в универе?', '2013-12-12 18:12:01', 1),
(5, 'Кто готов к сессии?', '2013-12-12 19:29:37', 1),
(6, 'Кто хочет кушать?', '2013-12-12 19:29:54', 1),
(7, 'Простая тема', '2013-12-14 19:01:26', 1),
(8, 'Еще одна тема', '2013-12-14 19:01:14', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE IF NOT EXISTS `users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `login` varchar(16) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `name` varchar(64) COLLATE utf8_unicode_ci DEFAULT NULL,
  `birthday` date DEFAULT NULL,
  `email` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=6 ;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `login`, `password`, `name`, `birthday`, `email`) VALUES
(1, 'admin', 'a3f05c8283e5350106829f855c93c07d', 'Administrator', '2013-10-25', 'admin@b1oki.dyndns.info'),
(2, 'ally', 'ebd556e6dfc99dbed29675ce1c6c68e5', 'AnnBee', '1993-09-02', 'annyaally@mail.ru'),
(3, 'demon', '962012d09b8170d912f0669f6d7d9d07', 'Иван Васильевич', '1992-12-01', 'admin@gmail.com'),
(4, 'egor', '803ed51973875789778cf19df8750478', 'Егорка', '1993-01-12', 'adolfus2000-gamer1@yahoo.com'),
(5, 'eocen', '76d80224611fc919a5d54f0ff9fba446', 'Егор', NULL, '');

-- --------------------------------------------------------

--
-- Структура таблицы `xml_files`
--

CREATE TABLE IF NOT EXISTS `xml_files` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `path` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `upload` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=3 ;

--
-- Дамп данных таблицы `xml_files`
--

INSERT INTO `xml_files` (`id`, `path`, `upload`) VALUES
(1, './files/sample.xml', '2014-08-20 08:48:01'),
(2, './files/1c_catalog_update.xml', '2014-08-20 19:33:15');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
